#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/0a763251-97ee-4d4d-84b7-7281fd02af2a/resourceGroups/DevRG]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_user_assigned_identity.example["user-identity-1"] will be created
  + resource "azurerm_user_assigned_identity" "example" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "user-identity-1"
      + principal_id        = (known after apply)
      + resource_group_name = "DevRG"
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.example["user-identity-2"] will be created
  + resource "azurerm_user_assigned_identity" "example" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "user-identity-2"
      + principal_id        = (known after apply)
      + resource_group_name = "DevRG"
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @ibrt2016, Action: `pull_request`, Working Directory: ``, Environment: `Development`, Workflow: `Create Infra with Terraform`*